Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: When you want your view to coordinate with other SwiftUI views, you must provide a Coordinator instance to facilitate those interactions.
ja: あなたがあなたのビューに他のSwiftUIビューと協調してほしい場合、あなたはCoordinatorインスタンスを提供してそれらの相互作用を円滑にしなければなりません。

source: When you write the document out as XML, the new or modified internal DTD is included (assuming you set the DTD in the XMLDocument instance).
ja: あなたが書類をXMLとして書き出す場合、新しいまたは修正されたDTDが含められます（あなたがDTDをXMLDocumentインスタンスの中に設定すると仮定して）。

source: Whenever the type of view used with an AnyView changes, the old hierarchy is destroyed and a new hierarchy is created for the new type.
ja: AnyViewで使われるビューの型が変化する時はいつでも、古い階層は壊されます、そして新しい階層は新しい型に対して作成されます。

source: Whenever the user taps the PlayButton, the PlayerView updates its isPlaying state.
ja: ユーザがPlayButtonをタップする時はいつでも、PlayerViewはそれのisPlaying状態を更新します。

source: While the following styles the text as 17 point bold, and applies a serif Font.Design to the system font:
ja: 一方で以下は、テキストを17ポイントboldとしてスタイル指定します、そしてserif Font.Designをシステムフォントへと適用します：

source: Widgets provide quick access to relevant content from your app.
ja: ウィジェットは、あなたのアプリから関連がある内容への素早いアクセスを提供します。

source: With a width of 100 points but no constraint on the height, a text view might wrap a long string:
ja: 100ポイントの幅しかし高さで制約なしで、テキストビューは長い文字列を自動改行（ワードラップ）するかもしれません：

source: With the basic landmark detail view set up, you need to provide a way for users to see the full list of landmarks, and to view the details about each location.
ja: 基本ランドマーク詳細ビュー設定で、あなたはユーザにある方法を提供する必要があります、ランドマークの完全なリストを見るために、そしてそれぞれの場所についての詳細を眺めるために。

source: Without the call to fixedSize(), the text view has its width set by its parent, which truncates the line of text.
ja: fixedSize()への呼び出しなしでは、テキストビューは、それの親によって設定されたそれの幅を持ちます、それはテキストの行を切り落とします。

source: Without the call to fixedSize(horizontal:vertical:), the text view has its width set by its parent, which truncates the line of text.
ja: fixedSize(horizontal:vertical:)への呼び出しなしでは、テキストビューは、それの親によって設定されたそれの幅を持ちます、それはテキストの行を切り落とします。

source: Work with higher quality of service classes receive more resources than work with lower quality of service classes whenever there is resource contention.
ja: より高い質のサービスクラスを扱う作業は、より低い質のサービスクラスを扱う作業より多くのリソースを受け取ります、リソース競合がある時はいつでも。

source: Working with Encodings
ja: エンコーディングを扱う

source: Working with UI Controls
ja: UIコントロールを扱う

source: Wrapping that view in another invisible one with a fixed 100 point width affects the layout of the composite view, but has no effect on the border.
ja: そのビューを別の不可視のものの中にある固定された100ポイント幅でラップすることは、合成ビューのレイアウトに影響します、しかし境界線に効果を及ぼしません。

source: Wraps the view in a compositing group.
ja: ビューをある合成グループの中に包みます。

source: Wraps this view as a new accessibility element.
ja: このビューを新しいアクセシビリティ要素としてラップします。

source: Wraps this view in a compositing group.
ja: このビューをある合成グループの中にラップ（包み込み）します。

source: Writing a Document as XML Data
ja: 書類をXMLデータとして書き出す

source: XML Processing and Modeling
ja: XMLの処理とモデリング

source: Xcode statically discovers types that conform to the PreviewProvider protocol in your app, and generates previews for each provider it discovers.
ja: Xcodeは、あなたのアプリにおいてPreviewProviderプロトコルに準拠する型を静的に見つけます、そしてそれが発見する各プロバイダに対してプレビューを生成します。

source: Yet the font modifier does apply to any of the stack’s child views, some of which might display text.
ja: それでもフォント修飾子は、スタックのもつ子ビューのどれに対しても適用されます、それのいくつかはテキストを表示するかもしれません。

source: You also use this method to sort elements that conform to the Comparable protocol in descending order.
ja: あなたはまた、このメソッドを使ってComparableプロトコルに準拠する要素を降順でソートすることができます。

source: You apply modifiers to views and controls to:
ja: あなたは、修飾子をビューとコントロールに適用することで：

source: You assign the scanner’s string when you create the scanner, and the scanner progresses through the characters of that string from beginning to end as you request items.
ja: あなたはそのスキャナーのもつ文字列を、あなたがスキャナーを作成する時に割り当てます、そしてスキャナーはあなたが項目を要請するときその文字列の文字を始めから終わりまで通して進んでいきます。

source: You can also apply view modifiers like bold() or italic() to further adjust the formatting.
ja: あなたはまた、bold()またはitalic()のようなビュー修飾子を適用することで、書式設定をさらに調節できます。

source: You can also connect animations to the state to animate how the view portrays the change.
ja: あなたはまた、アニメーションをその状態に対して接続して、どのようにビューがその変更を描写するかアニメーション化できます。

source: You can also construct an XMLDocument programmatically.
ja: あなたはまた、XMLDocumentをプログラム的に組み立てられます。

source: You can also customize accessibility support in SwiftUI, and localize your app’s interface for different languages, countries, or cultural regions.
ja: あなたはまた、アクセシビリティサポートをSwiftUIにおいてカスタマイズできます、そしてアプリのもつインターフェイスを異なる言語、国、または文化圏に対してローカライズできます。

source: You can also update system-provided menus using a CommandGroup.
ja: あなたはまたシステム提供のメニューを、CommandGroupを使って更新できます。

source: You can also use the $ prefix operator with any property of a State to create a binding.
ja: あなたはまた、$接頭辞演算子をStateの何らかのプロパティとともに使用して、バインディングを作成できます。

source: You can choose a different standard font, like title or caption, using the font(_:) view modifier.
ja: あなたは、titleまたはcaptionのような、異なる標準フォントを選ぶことがfont(_:)ビュー修飾子を使って可能です。

source: You can combine static views with views that are dynamically generated from collections of data.
ja: あなたは、静的ビューを、動的にデータのコレクションから生成されるビューと結合できます。

source: You can convert the anchor to a Value in the coordinate space of a target view by using a LayoutContext to specify the target view.
ja: あなたは、アンカーをターゲットビューの座標空間の中のあるValueに変換することが、LayoutContextを使ってそのターゲッドビューを指定することで行えます。

source: You can create an XMLDTDNode object with the init(xmlString:) method, the XMLNode class method dtdNode(withXMLString:), or with the XMLNode initializer init(kind:options:) (in the latter method supplying the appropriate XMLNode.Kind constant).
ja: あなたは、XMLDTDNodeオブジェクトをinit(xmlString:)メソッド、XMLNodeのクラスメソッドdtdNode(withXMLString:)で、またはXMLNodeのイニシャライザinit(kind:options:)で作成できます（後者のメソッドにおいて適切なXMLNode.Kind定数を提供することで）。

source: You can customize a button’s appearance and interaction behavior.
ja: あなたは、ボタンのもつ外観と相互作用挙動をカスタマイズできます。

source: You can customize the appearance and interaction of a text field using a TextFieldStyle instance.
ja: あなたは、テキストフィールドの外観と相互作用をカスタマイズすることが、TextFieldStyleインスタンスを使って可能です。

source: You can define shapes in relation to an implicit frame of reference, such as the natural size of the view that contains it.
ja: あなたは、たとえばそれを含むビューの現寸など、暗黙的な基準系に関して形状を定義できます。

source: You can expect faster execution when the collections share many common elements, or if Element conforms to Hashable.
ja: あなたは、コレクションが多くの共通する要素を共有する時は、またはElementがHashableに準拠するならば、より速い遂行を期待できます。

source: You can expect faster execution when the collections share many common elements.
ja: あなたは、コレクションが多くの共通する要素を共有する時は、より速い遂行を期待できます。

source: You can get a binding from a State by accessing its binding property.
ja: あなたはバインディングを、Stateからそれのbindingプロパティにアクセスすることによって取得できます。

source: You can get a list of supported values, like “iPhone 11”, “iPad Pro (11-inch)”, and “Apple Watch Series 5 - 44mm” by using the xcrun command in the Terminal app:
ja: あなたは、“iPhone 11”、“iPad Pro (11-inch)”、そして “Apple Watch Series 5 - 44mm” のような、サポートされる値のリストを得ることがxcrunコマンドをTerminalアプリで使うことで可能です：

source: You can integrate SwiftUI views with objects from the UIKit, AppKit, and WatchKit frameworks to take further advantage of platform-specific functionality.
ja: あなたは、SwiftUIビューとUIKit、AppKit、そしてWatchKitフレームワークのさまざまなオブジェクトを統合することで、プラットホーム特有の機能性をさらに利用できます。

source: You can override a button’s style.
ja: あなたは、ボタンのもつスタイルをオーバーライドできます。

source: You can override a picker’s style.
ja: あなたは、ピッカーのもつスタイルをオーバーライドできます。

source: You can override this method to perform custom tasks asssociated with the appearance of the view.
ja: あなたは、このメソッドをオーバーライドして、ビューの外観と結びつけられたあつらえのタスクを実行できます。

source: You can return a constant or can use the ViewDimensions argument to the closure to calculate a return value.
ja: あなたは、定数を返すことができます、またはViewDimensions引数をクロージャに対して使って戻り値を計算することができます。

source: You can reverse a collection without allocating new space for its elements by calling this reversed() method.
ja: あなたは、あるコレクションを逆順にすることがそれの要素に対して新しい空間を割り当てることなくreversed()メソッドによって可能です。

source: You can skip registration of an undo operation when this value is nil.
ja: あなたは、あるやり直し操作の登録を省くことが、この値がnilの場合は可能です。

source: You can sort any sequence of elements that conform to the Comparable protocol by calling this method.
ja: あなたはいくらかの要素からなる何らかのシーケンスでComparableプロトコルに準拠するものをこのメソッドを呼び出すことによってソートする（並び替える）ことができます。

source: You can specify a principal view for multiple visible bars; however, the system only honors the request for one of them.
ja: あなたは、ある主役ビューを複数の可視のバーに対して指定できます；しかしながら、システムはそれらの１つに対する要請に敬意を払うだけです。

source: You can specify images and colors in asset catalogs according to either the ColorScheme.light or ColorScheme.dark color scheme, as well as standard or increased contrast.
ja: あなたは、画像と色をアセットカタログにおいて指定することが、ColorScheme.lightまたはColorScheme.darkカラースキームのどちらかによって可能です、それだけでなく標準または増大されたコントラストも。

source: You can specify these options in the NSXMLNode methods init(kind:options:) and xmlString(options:).
ja: あなたは、３つのオプションをNSXMLNodeのメソッドinit(kind:options:)とxmlString(options:)において指定できます。

source: You can subclass NSXMLElement if you want element nodes with more specialized attributes or behavior, for example, paragraph and font attributes that specify how the string value of the element should appear.
ja: あなたは、NSXMLElementのサブクラスを作ることができます、もしあなたがより特殊化された属性または挙動を持つ要素ノードを望むならば、例えば、段落およびフォント属性、それはどのようにその要素の文字列値が現れるべきか指定します。

source: You can subclass XMLNode if you want nodes of kinds different from the supported ones, You can also create a subclass with more specialized attributes or behavior than XMLNode.
ja: あなたは、XMLNodeのサブクラスを作成できます、もしあなたがサポートされるものとは違う種類のノードを望むならば、あなたはまたXMLNodeよりも特殊化された属性または挙動を持つサブクラスを作成できます。

source: You can truncate at the beginning, middle, or end of the text view.
ja: あなたは、テキストビューの始まり、中間、または終わりで切り詰める事ができます。

source: You can use onChange to trigger a side effect as the result of a value changing, such as an Environment key or a Binding.
ja: あなたは、onChangeを使ってある副作用を引き起こすことが、たとえばEnvironmentキーまたはBindingなど、ある値の変化の結果として行えます。

source: You can use SwiftUI, working together with WidgetKit, to add widgets to your app.
ja: あなたはSwiftUIを使用することで、WidgetKitと一緒に働いて、ウィジェットをあなたのアプリに追加できます。

source: You can use a DTD node’s subkind to help determine how to handle the value of the node.
ja: あなたはDTDノードの持つ下位種類を使って、ノードの値をどのように処理するか判定する助けにできます。

source: You can use an array literal anywhere a set is expected by the type context.
ja: あなたは、型コンテキストによって集合が予期される何処ででも配列リテラルを使うことができます。

source: You can use built-in scenes, like WindowGroup, or you can compose custom scenes that conform to the Scene protocol.
ja: あなたはWindowGroupのような、組み込みのシーンを使用できます、またはあなたはSceneプロトコルに準拠するあつらえのシーンを構成できます。

source: You can use the uintValue method on the NSNumber object to retrieve the value of the change kind.
ja: あなたは、uintValueメソッドをNSNumberオブジェクト上で使うことで、この変更種類の値を取ってこれます。

source: You can use the unsignedIntegerValue method on the NSNumber object to retrieve the value of the change kind.
ja: あなたは、unsignedIntegerValueメソッドをNSNumberオブジェクト上で使うことで、この変更種類の値を取ってこれます。

source: You can use the predicate to check for an element of a type that doesn’t conform to the Equatable protocol, such as the HTTPResponse enumeration in this example.
ja: あなたは述部を使って、Equatableプロトコルに準拠しない型、例えばこの例でのHTTPResponse列挙などの要素に対して調べることができます。

source: You can use the predicate to find an element of a type that doesn’t conform to the Equatable protocol or to find an element that matches particular criteria.
ja: あなたは述部を使って、Equatableプロトコルに準拠しない型の要素を見つける、または特定の基準に合致する要素を見つけることができます。

source: You can use the unary plus operator (+) to provide symmetry in your code for positive numbers when also using the unary minus operator.
ja: あなたは、単項加算演算子（+）を使って、対称性を正の数に対してあなたにコードにおいて提供できます、同様に単項減算演算子を使う時に。

source: You can use this type of partial range of a collection’s indices to represent the range from the partial range’s lower bound up to the end of the collection.
ja: あなたは、あるコレクションのインデックスからなる、この型の部分的範囲を使うことで、その部分的な範囲の下側の境界からそのコレクションの終わりまでの範囲を表すことができます。

source: You can use this type of partial range of a collection’s indices to represent the range from the start of the collection up to, and including, the partial range’s upper bound.
ja: あなたは、あるコレクションのインデックスからなる、この型の部分的範囲を使うことで、コレクションの始まりからその部分的な範囲の上側の境界までの、そしてそれを含んでいる範囲を表すことができます。

source: You can use this type of partial range of a collection’s indices to represent the range from the start of the collection up to, but not including, the partial range’s upper bound.
ja: あなたは、あるコレクションのインデックスからなる、この型の部分的範囲を使うことで、コレクションの始まりからその部分的な範囲の上側の境界までの、しかしそれを含んでいない範囲を表すことができます。

source: You cannot use a break or continue statement to exit the current call of the body closure or skip subsequent calls.
ja: あなたは、breakまたはcontinue文を使って、bodyクロージャの現在の呼び出しを抜け出したり、または続いて起こる呼び出しを飛ばしたりできません。

source: You commonly chain modifiers, each wrapping the result of the previous one.
ja: あなたは普通に修飾子を連鎖状にします、それぞれ前のものの結果をラップしています。

source: You create a button by providing an action and a label.
ja: あなたはボタンを、アクションとラベルを提供することによって作成します。

source: You create a value transformer by subclassing ValueTransformer and overriding the necessary methods to provide the required custom transformation.
ja: あなたは、値変換器の作成を、ValueTransformerのサブクラスを作成して必要なメソッドをオーバーライドして望むあつらえの変換を提供することで行います。

source: You create an NSXMLDTD object in one of three ways:
ja: あなたは、NSXMLDTDオブジェクトを３つの方法のうち１つで作成します：

source: You create custom views by declaring types that conform to the View protocol.
ja: あなたは、あつらえのビューをViewプロトコルに準拠する型を宣言することによって作成します。

source: You don’t call this initializer directly.
ja: あなたは、このイニシャライザを直接に呼び出しません。

source: You have comprehensive control over drop behavior when you use a delegate.
ja: あなたは、ドロップ挙動について、あなたが委任先を使う場合に、包括的な制御を持ちます。

source: You may also programmatically create an external DTD and write that out to its own file.
ja: あなたはまた、プログラム的に外部DTDを作成して、それをそれ独自のファイルへと書き出すかもしれません。

source: You may need to experiment to find the level of sensitivity that works for your use case.
ja: あなたは、感度レベルを捜す試みをする必要があるかもしれません、

source: You may need to experiment to find the value that is appropriate for your use case.
ja: あなたは、あなたの利用状況に適切である値を見つけるために実験する必要があるかもしれません。

source: You must implement this method and use it to create your interface object.
ja: あなたは、このメソッドを実装して、そしてそれを使ってあなたのインターフェイスオブジェクトを作成しなければなりません。

source: You must implement this method and use it to create your view controller object.
ja: あなたは、このメソッドを実装して、そしてそれを使ってあなたのビューコントローラオブジェクトを作成しなければなりません。

source: You must implement this method and use it to create your view object.
ja: あなたは、このメソッドを実装して、そしてそれを使ってあなたのビューオブジェクトを作成しなければなりません。

source: You must set a model object on an ancestor view by calling its environmentObject(_:) method.
ja: あなたは、あるモデルオブジェクトをアンカービュー上でそれのenvironmentObject(_:)メソッドを呼び出すことによって設定しなければなりません。

source: You must subclass WKHostingController and override the body property to provide the set of SwiftUI views you want to display.
ja: あなたは、WKHostingControllerのサブクラスを作ってそしてbodyプロパティをオーバーライドすることで、あなたが表示したい一揃いのSwiftUIビューを提供しなければなりません。

source: You must subclass WKUserNotificationHostingController and override the body property to provide the set of SwiftUI views you want to display.
ja: あなたは、WKUserNotificationHostingControllerのサブクラスを作ってそしてbodyプロパティをオーバーライドすることで、あなたが表示したい一揃いのSwiftUIビューを提供しなければなりません。

source: You only need to check colorScheme and colorSchemeContrast for custom drawing if the differences go beyond images and colors.
ja: 差異が画像と色を越えているならば、あなたはcolorSchemeとcolorSchemeContrastをあつらえの描画に対して確認するだけで済みます。

source: You set the DTD-node kind using the setDTDKind: method.
ja: あなたは、DTDノード種類をsetDTDKind:メソッドを使って設定します。

source: You should generally write helper applications as XPC Services instead, because XPC Services allows you to specify different sandbox entitlements for helper apps.
ja: あなたは、一般にヘルパーアプリケーションをXPC Serviceとして代わりに書くべきです、なぜならXPC Serviceはあなたに異なるサンドボックス資格をヘルパーアプリケーションそれらに指定できるようにするからです。

source: You should only access a state property from inside the view’s body, or from methods called by it.
ja: あなたは、状態プロパティにビューの本体内から、またはそれによって呼び出されるメソッドからアクセスするだけであるべきです。

source: You then register the value transformer using the setValueTransformer(_:forName:) method, so that other parts of your app can access it by name with init(forName:).
ja: あなたはそれから値変換器をsetValueTransformer(_:forName:)メソッドを使って登録します、そうしてあなたのアプリの他の部分は名前によってそれにアクセスすることがinit(forName:)で可能です。

source: You typically use ViewBuilder as a parameter attribute for child view-producing closure parameters, allowing those closures to provide multiple child views.
ja: あなたは概して、ViewBuilderをパラメータ属性として子ビュー生産クロージャパラメータに対して使って、それらクロージャに複数の子ビューの提供を許可します。

source: You use NSHostingView objects to integrate SwiftUI views into your AppKit view hierarchies.
ja: あなたは、NSHostingViewオブジェクトを使って、SwiftUIビューをAppKitビュー階層へと統合します。

source: You use appStoreOverlay to display an overlay that recommends another app.
ja: あなたは、appStoreOverlayを使ってあるオーバーレイを表示します、それは別のアプリをお勧めするものです。

source: You use gesture composition to define the order SwiftUI recognizes gestures.
ja: あなたはジェスチャ合成を使って、より古いSwiftUIが認識するジェスチャを定義します。

source: You use this method to randomize the elements of a sequence when you are using a custom random number generator.
ja: あなたは、あなたがあつらえの乱数生成子を使っている時このメソッドを使ってシーケンスの要素をランダム化します。

source: Your AppKit view configured with the provided information.
ja: あなたのAppKitビュー、この提供された情報で構成設定されます。

source: Your AppKit view controller configured with the provided information.
ja: あなたのAppKitビューコントローラ、この提供された情報で構成設定されます。

source: Your UIKit view configured with the provided information.
ja: あなたのUIKitビュー、この提供された情報で構成設定されます。

source: Your UIKit view controller configured with the provided information.
ja: あなたのUIKitビューコントローラ、この提供された情報で構成設定されます。

source: Your app cannot override the user’s choice.
ja: あなたのアプリは、ユーザの選択を上書きできません。

source: Your custom interface object.
ja: あなたのあつらえのインターフェイスオブジェクト。

source: Your custom view controller object.
ja: あなたのあつらえのビューコントローラオブジェクト。

source: Your custom view object.
ja: あなたのあつらえのビューオブジェクト。

source: Your interface object configured with the provided information.
ja: あなたのインターフェイスオブジェクト、この提供された情報で構成設定されます。

source: You’ll start by building the view that shows a landmark’s details.
ja: あなたは、あるランドマークのもつ詳細を示すビューを構築することによって始めます。

source: Zero is the identity element for addition.
ja: ゼロは、加法の単位元です。

source: iOS uses the borderless button style by default, whereas macOS, tvOS, and watchOS use the bordered button style.
ja: iOSは、境界線なしボタンを初期状態で使います、一方でmacOS、tvOS、そしてwatchOSは、境界線付きボタンスタイルを使います。

source: isContinuous: Controls if the value reported stops at minValue and maxValue or if it should wrap around.
ja: isContinuous: 報告される値がminValueおよびmaxValueで止まるかどうかまたはそれがラップアラウンドするべきかどうかを制御します。

source: isHapticFeedbackEnabled: Controls the generation of haptic feedback when turning the Digital Crown.
ja: isHapticFeedbackEnabled: 触覚フィードバックの発生を、「デジタルクラウン」を回している時にsgi制御します。

source: negative values invert colors in addition to applying contrast.
ja: 負の値は、コントラストを加えることに加えて色を反転します。

source: newValue: The new value of the binding value.
ja: newValue: バインディング値の新しい値。

source: result
ja: 結果

source: the bundle to search for the color resource in.
ja: カラーリソースをその中で検索することになるバンドル。

source: the bundle to search for the image resource and localization content.
ja: 画像リソースおよびローカライゼーション内容を検索するバンドル。

source: the bundle to search for the image resource.
ja: 画像リソースを検索することになるバンドル。

source: the hash value is not guaranteed to be stable across different invocations of the same program.
ja: ハッシュ値は、同じプログラムの異なる発動を越えて永続的であると保証されません。

source: the name of the color resource to lookup.
ja: 捜すカラーリソースの名前。

source: the name of the image resource to lookup
ja: 探し出す画像リソースの名前

source: the name of the image resource to lookup, as well as the localization key with which to label the image.
ja: 検索する画像リソースの名前、それだけでなくそれで画像にラベルをつけることになるローカライゼーションキー。

source: transaction: The transaction to apply when setting a new value.
ja: transaction: 新しい値を設定する時に適用するトランザクション。

source: Exclusive
ja: 排他的に

source: Sequenced
ja: 順番に

source: Simultaneous
ja: 同時に

source: Shapes
ja: 形状

source: Images
ja: 画像
